{"config": [{"config": {"kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [5, 5], "activity_regularizer": null, "padding": "valid", "activation": "relu", "strides": [1, 1], "filters": 32, "dilation_rate": [1, 1], "use_bias": true, "trainable": true, "name": "conv2d_1", "dtype": "float32", "batch_input_shape": [null, 28, 28, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "name": "batch_normalization_1", "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "trainable": true, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_size": [5, 5], "activity_regularizer": null, "padding": "valid", "activation": "relu", "strides": [1, 1], "filters": 64, "dilation_rate": [1, 1], "use_bias": true, "trainable": true, "kernel_regularizer": null, "name": "conv2d_2", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "name": "batch_normalization_2", "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "trainable": true, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "dense_1", "activation": "relu", "units": 256, "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "dense_2", "activation": "softmax", "units": 10, "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2"}