{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "padding": "valid", "dtype": "float32", "kernel_constraint": null, "strides": [1, 1], "use_bias": true, "activation": "relu", "batch_input_shape": [null, 28, 28, 1], "filters": 32, "kernel_size": [5, 5], "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "beta_regularizer": null, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": -1, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "trainable": true, "padding": "valid", "activation": "relu", "use_bias": true, "kernel_constraint": null, "filters": 64, "kernel_size": [5, 5], "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "beta_regularizer": null, "scale": true, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "axis": -1, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "units": 512, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "relu", "use_bias": true, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activity_regularizer": null, "units": 10, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "softmax", "use_bias": true, "kernel_constraint": null}}]}