{"backend": "tensorflow", "keras_version": "2.0.2", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [5, 5], "bias_constraint": null, "use_bias": true, "filters": 32, "bias_regularizer": null, "trainable": true, "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "padding": "valid", "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "batch_input_shape": [null, 28, 28, 1], "name": "conv2d_1", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32"}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "center": true, "beta_regularizer": null, "trainable": true, "axis": -1, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"kernel_size": [5, 5], "bias_constraint": null, "use_bias": true, "filters": 64, "bias_regularizer": null, "trainable": true, "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "padding": "valid", "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2"}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "center": true, "beta_regularizer": null, "trainable": true, "axis": -1, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "name": "batch_normalization_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1024, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "activation": "softmax", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "name": "dense_2"}}], "class_name": "Sequential"}