{"config": [{"config": {"filters": 32, "trainable": true, "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "bias_regularizer": null, "dilation_rate": [1, 1], "batch_input_shape": [null, 28, 28, 1], "kernel_size": [5, 5], "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "padding": "valid", "activity_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "name": "batch_normalization_1", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_constraint": null, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_1", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 64, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [5, 5], "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "padding": "valid", "activity_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "name": "batch_normalization_2", "epsilon": 0.001, "momentum": 0.99, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "gamma_constraint": null, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_2", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 1024, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_1", "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"units": 10, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_2", "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "activity_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2"}