{"class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "Conv2D", "config": {"padding": "valid", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "dtype": "float32", "filters": 32, "data_format": "channels_last", "batch_input_shape": [null, 28, 28, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_1", "trainable": true, "kernel_constraint": null, "strides": [1, 1], "activation": "relu"}}, {"class_name": "Conv2D", "config": {"padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "filters": 64, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_2", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "padding": "valid", "strides": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_1", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"padding": "valid", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "dtype": "float32", "filters": 32, "data_format": "channels_last", "batch_input_shape": [null, 28, 28, 1], "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_3", "trainable": true, "kernel_constraint": null, "strides": [1, 1], "activation": "relu"}}, {"class_name": "Conv2D", "config": {"padding": "valid", "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "filters": 64, "data_format": "channels_last", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "kernel_size": [3, 3], "use_bias": true, "name": "conv2d_4", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": true, "padding": "valid", "strides": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "momentum": 0.99, "name": "batch_normalization_2", "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "units": 1024, "kernel_constraint": null, "name": "dense_1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "units": 10, "kernel_constraint": null, "name": "dense_2", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax"}}], "backend": "tensorflow"}