{"keras_version": "2.0.2", "config": [{"config": {"batch_input_shape": [null, 28, 28, 1], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "strides": [1, 1], "use_bias": true, "filters": 32, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_size": [5, 5], "bias_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"beta_constraint": null, "momentum": 0.99, "name": "batch_normalization_1", "scale": true, "gamma_constraint": null, "epsilon": 0.001, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_2", "strides": [1, 1], "use_bias": true, "filters": 64, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_size": [5, 5], "bias_constraint": null, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"beta_constraint": null, "momentum": 0.99, "name": "batch_normalization_2", "scale": true, "gamma_constraint": null, "epsilon": 0.001, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "gamma_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 1024, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 10, "activity_regularizer": null, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}