{"backend": "tensorflow", "config": [{"config": {"use_bias": true, "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "padding": "valid", "activity_regularizer": null, "name": "conv2d_1", "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dtype": "float32", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "filters": 32, "strides": [1, 1], "batch_input_shape": [null, 28, 28, 1], "kernel_size": [5, 5]}, "class_name": "Conv2D"}, {"config": {"axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "scale": true, "trainable": true, "center": true, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_1", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "trainable": true, "use_bias": true, "data_format": "channels_last", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [5, 5], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "filters": 64, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "scale": true, "trainable": true, "center": true, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_2", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_2", "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 2048, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "rate": 1.0, "trainable": true}, "class_name": "Dropout"}, {"config": {"use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "activity_regularizer": null, "name": "dense_2", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 10, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.0.2", "class_name": "Sequential"}