{"keras_version": "2.0.2", "config": [{"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "use_bias": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "bias_regularizer": null, "filters": 32, "bias_constraint": null, "trainable": true, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "use_bias": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "bias_regularizer": null, "filters": 64, "bias_constraint": null, "trainable": true, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "axis": -1, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_1", "beta_constraint": null, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_regularizer": null, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_3", "use_bias": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [5, 5], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "bias_regularizer": null, "filters": 128, "bias_constraint": null, "trainable": true, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "axis": -1, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_2", "beta_constraint": null, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_regularizer": null, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "use_bias": true, "units": 1024, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_2", "use_bias": true, "units": 10, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "activation": "softmax", "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}